Revit 2027 API
AnalysisDisplayStyleVectorPosition Enumeration
 Defines vector position for vector settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalysisDisplayStyleVectorPosition
Public Enumeration AnalysisDisplayStyleVectorPosition
public enum class AnalysisDisplayStyleVectorPosition
type AnalysisDisplayStyleVectorPosition
Members
Member name | Value | Description
FromDataPoint | 1
ToDataPoint | 0
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace